cf_billing/InformationRegisters/энргМаксимальныеПоказания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргМаксимальныеПоказания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиТЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугами</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСЛицевымСчетом</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОбходнойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСхемуПодчиненностиТочекУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийАбонента</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктированиеНедопускаДопускаВПомещение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНомераСтрокСтабильногоПериодаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНомераСтрокСтабильногоПериодаМКД</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчетаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОткрытиеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщикаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугамиМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьБойлерМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьЗначениеПлощадиМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргВводНачальныхОстатковМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчетаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидБлагоустройстваМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьСпособРаспределенияОбъемаМКДНаАбонентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonModules/ОбновлениеИнформационнойБазыБиллинг/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки СтандартныеПодсистемы (БСП).
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя = "Биллинг";
 	Описание.Версия = "2.0.5.6";	
 	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре.
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Монопольно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	 
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.1.1.1";
	Обработчик.Процедура           = "МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьПоставляемыеДрайвера";
	Обработчик.НачальноеЗаполнение = Истина; // Надо выполнять при обновлении с 2БП на 3БП
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.1.1.1";
	Обработчик.Процедура           = "МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьПоставляемыеДрайвера";
	Обработчик.НачальноеЗаполнение = Истина; // Надо выполнять при обновлении с 2БП на 3БП
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.1.1.1";
	Обработчик.Процедура           = "МенеджерОборудованияВызовСервераПереопределяемый.ОбновитьДрайверыВСправочникеПодключаемогоОборудования";
	Обработчик.НачальноеЗаполнение = Ложь; // Надо выполнять при обновлении с 2БП на 3БП  
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргКонтрагенты.ОбновитьПредопределенныеВидыКонтактнойИнформацииКонтрагенты";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргАбоненты.ОбновитьПредопределенныеВидыКонтактнойИнформацииАбоненты";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргФилиалы.ОбновитьПредопределенныеВидыКонтактнойИнформацииФилиалы";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргСтроения.ОбновитьПредопределенныеВидыКонтактнойИнформацииМногоквартирныеДома";
		
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.Организации.ОбновитьПредопределенныеВидыКонтактнойИнформацииОрганизаций";

	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура			= "Справочники.энргКонтрагенты.ОбновитьПредопределенныеВидыКонтактнойИнформацииКонтрагенты"; 
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.ФизическиеЛица.ОбновитьПредопределенныеВидыКонтактнойИнформацииФизическиеЛица";

	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура			= "РегистрыСведений.энргНастройкиПечатныхФорм.ОбновитьДопустимыеНастройки";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргПомещения.ОбновитьПредопределенныеВидыКонтактнойИнформацииПомещения";
				
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.13";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргСлужбыСудебныхПристовов.ОбновитьПредопределенныеВидыКонтактнойИнформацииПомещения";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.13";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргУлицыНедобавленныеВФИАС.ОбновитьПредопределенныеВидыКонтактнойИнформацииУлицыНедобавленнойВФИАС";
	
 	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргВидыДифференцированности.ОбновитьПредопределенныеЭлементы";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "1.1.1.1";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргЗоныОтвественности.ОбновитьПредопределенныеВидыКонтактнойИнформацииРайонов";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.0.5.2";
	Обработчик.НачальноеЗаполнение 	= Ложь;
	Обработчик.Процедура 			= "РегистрыСведений.энргМаксимальныеПоказания.ЗаполнитьИзмерениеРегистратор";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.0.5.2";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура			= "Справочники.энргКонтрагенты.ОбновитьПредопределенныеВидыКонтактнойИнформацииКонтрагенты";
	
	Обработчик 						= Обработчики.Добавить();
	Обработчик.Версия 				= "2.0.5.2";
	Обработчик.НачальноеЗаполнение 	= Истина;
	Обработчик.Процедура 			= "Справочники.энргАбоненты.ОбновитьПредопределенныеВидыКонтактнойИнформацииАбоненты";
		
КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
// Пример обхода выполненных обработчиков обновления:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
			
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
		
КонецПроцедуры

#КонецОбласти

#Область ФункцииПереходаВерсий

&НаСервере
Процедура ЗаполнитьИзмерения_МКД()
	
	Запрос  								= Новый Запрос;
	Запрос.Текст 							= 
	"ВЫБРАТЬ
	|	энргНомераСтрокСтабильногоПериодаМКД.Регистратор,
	|	МАКСИМУМ(энргНомераСтрокСтабильногоПериодаМКД.Период) КАК Период
	|ИЗ
	|	РегистрСведений.энргНомераСтрокСтабильногоПериодаМКД КАК энргНомераСтрокСтабильногоПериодаМКД
	|
	|СГРУППИРОВАТЬ ПО
	|	энргНомераСтрокСтабильногоПериодаМКД.Регистратор";
	
	Результат  								= Запрос.Выполнить();
	Выборка  								= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		Набор  								= РегистрыСведений.энргНомераСтрокСтабильногоПериодаМКД.СоздатьНаборЗаписей();
		Набор.Отбор.регистратор.установить(Выборка.Регистратор);
		Набор.Прочитать();
		Для Каждого СтрокаНабора из Набор цикл
			СтрокаНабора.ДокРегистратор 	= Выборка.Регистратор;
			СтрокаНабора.ДатаРегистратора 	= Выборка.Период;
		КонецЦикла;
		Набор.Записать();
	КонецЦикла; 	
КонецПроцедуры


#КонецОбласти
